package com.javaex.practice;

public class Ex06 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

		/*
		 		 
		아래의 설명중 틀린 것을 찾아서 수정해 보세요.
		(1)	변수한개에는 동시에 여러 개의 값을 담을 수 있다.
		(2)	변수는 선언시에 사용한 타입의 값만 저장할 수 있다.
		(3)	변수는 초기값이 저장되지 않아도 읽을 수 있다.
		(4)	모든 자료형의 변수는 동일한 방식으로 저장된다. 
		(5)	double형은 flaot보다 큰 수를 담을 수 있다.
		(6)	int, float, char, String은 모두 기본자료형에 속한다
		(7)	final로 선언된 변수는 수정이 가능하다
		(8)	long형은 항상 L을 붙여서 대입해야한다.
		(9)	float형은 항상 F을 분여서 대입해야한다.
		
		1-> 변수는 여러개의 값을 담을 수 없다
		2-> 변수는 바뀔수 있다
		3-> 변수는 초기값이 지정되어야 사용할수 있다
		4-> 참조 자료형 변수는 기본자료형과 같이 스택 메모리에 저장되지만 데이터 값은 힙 메모리 영역에 저장된다
		6-> String은 기본자료형이 아니다
		7-> final로 선언된 변수는 수정이 불가하다
		8-> long형은 int범위를 넘어선 수에 l을 붙여서 대입하면 된다
		
		
		
		*/

	}

}
